betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_flash_ex.c
  return status;
}

#endif /* APM32F40xxx || APM32F41xxx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F411xx)
/**
  * @brief  Enable the read/write protection (PCROP) of the desired sectors.
  * @param  Sector specifies the sector(s) to be read/write protected or unprotected.
  *          This parameter can be one of the following values:
  *            @arg OB_PCROP: A value between OB_PCROP_Sector0 and OB_PCROP_Sector5
  *            @arg OB_PCROP_Sector_All
  * @retval DAL Status
  */
static DAL_StatusTypeDef FLASH_OB_EnablePCROP(uint32_t Sector)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_OB_PCROP(Sector));

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

  if (status == DAL_OK)
  {
    *(__IO uint16_t *)OPTCTRL_BYTE2_ADDRESS |= (uint16_t)Sector;
  }

  return status;
}

/**
  * @brief  Disable the read/write protection (PCROP) of the desired sectors.
  * @param  Sector specifies the sector(s) to be read/write protected or unprotected.
  *          This parameter can be one of the following values:
  *            @arg OB_PCROP: A value between OB_PCROP_Sector0 and OB_PCROP_Sector5
  *            @arg OB_PCROP_Sector_All
  * @retval DAL Status
  */
static DAL_StatusTypeDef FLASH_OB_DisablePCROP(uint32_t Sector)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_OB_PCROP(Sector));

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

  if (status == DAL_OK)
  {
    *(__IO uint16_t *)OPTCTRL_BYTE2_ADDRESS &= (~Sector);
  }

  return status;

}
#endif /* APM32F411xx */

#if defined (APM32F403xx) || defined (APM32F402xx)
/**
  * @brief  Full erase of FLASH memory Bank
  * @param  Banks Banks to be erased
  *          This parameter can be one of the following values:
  *            @arg @ref FLASH_BANK_1 Bank1 to be erased
  *
  * @retval None
  */
static void FLASH_MassErase(uint32_t Banks)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_FLASH_BANK(Banks));

  /* Clean the error context */
  pFlash.ErrorCode = DAL_FLASH_ERROR_NONE;

  /* Only bank1 will be erased*/
  SET_BIT(FLASH->CTRL2, FLASH_CTRL2_MASSERA);
  SET_BIT(FLASH->CTRL2, FLASH_CTRL2_STA);
}

/**
  * @brief  Erase the specified FLASH memory page
  * @param  PageAddress FLASH page to erase
  *         The value of this parameter depend on device used within the same series
  *
  * @retval None
  */
void FLASH_PageErase(uint32_t PageAddress)
{
  /* Clean the error context */
  pFlash.ErrorCode = DAL_FLASH_ERROR_NONE;

  /* Proceed to erase the page */
  SET_BIT(FLASH->CTRL2, FLASH_CTRL2_PAGEERA);
  WRITE_REG(FLASH->ADDR, PageAddress);
  SET_BIT(FLASH->CTRL2, FLASH_CTRL2_STA);
}

/**
  * @brief  Enable the write protection of the desired pages
  * @note   An option byte erase is done automatically in this function.
  * @note   When the memory read protection level is selected (RDP level = 1),
  *         it is not possible to program or erase the flash page i if
  *         debug features are connected or boot code is executed in RAM, even if nWRPi = 1
  *
  * @param  WriteProtectPage specifies the page(s) to be write protected.
  *         The value of this parameter depend on device used within the same series
  * @retval HAL status
  */
static DAL_StatusTypeDef FLASH_OB_EnableWRP(uint32_t WriteProtectPage, uint32_t Banks)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint16_t WRP0_Data = 0xFFFF;
  uint16_t WRP1_Data = 0xFFFF;
  uint16_t WRP2_Data = 0xFFFF;
  uint16_t WRP3_Data = 0xFFFF;

  /* Check the parameters */
  ASSERT_PARAM(IS_OB_WRP(WriteProtectPage));
  ASSERT_PARAM(IS_FLASH_BANK(Banks));

  /* Get current write protected pages and the new pages to be protected ******/
  WriteProtectPage = (uint32_t)(~((~FLASH_OB_GetWRP()) | WriteProtectPage));

  WRP0_Data = (uint16_t)(WriteProtectPage & OB_WRP_PAGES0TO15MASK);
  WRP1_Data = (uint16_t)((WriteProtectPage & OB_WRP_PAGES16TO31MASK) >> 8U);
  WRP2_Data = (uint16_t)((WriteProtectPage & OB_WRP_PAGES32TO47MASK) >> 16U);
  WRP3_Data = (uint16_t)((WriteProtectPage & OB_WRP_PAGES48TO127MASK) >> 24U);

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

  if(status == DAL_OK)
  {
    /* Clean the error context */
    pFlash.ErrorCode = DAL_FLASH_ERROR_NONE;

    /* To be able to write again option byte, need to perform a option byte erase */
    status = DAL_FLASHEx_OBErase();
    if (status == DAL_OK)
    {
      /* Enable write protection */
      SET_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);

      if(WRP0_Data != 0xFFU)
      {
        OB->WRP0 &= WRP0_Data;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
      }

      if((status == DAL_OK) && (WRP1_Data != 0xFFU))
      {
        OB->WRP1 &= WRP1_Data;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
      }

      if((status == DAL_OK) && (WRP2_Data != 0xFFU))
      {
        OB->WRP2 &= WRP2_Data;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
      }

      if((status == DAL_OK) && (WRP3_Data != 0xFFU))
      {
        OB->WRP3 &= WRP3_Data;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
      }

      /* if the program operation is completed, disable the OPTPG Bit */
      CLEAR_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);
    }
  }

  return status;
}

/**
  * @brief  Disable the write protection of the desired pages
  * @note   An option byte erase is done automatically in this function.
  * @note   When the memory read protection level is selected (RDP level = 1),
  *         it is not possible to program or erase the flash page i if
  *         debug features are connected or boot code is executed in RAM, even if nWRPi = 1
  *
  * @param  WriteProtectPage specifies the page(s) to be write unprotected.
  *         The value of this parameter depend on device used within the same series
  * @retval DAL status
  */
static DAL_StatusTypeDef FLASH_OB_DisableWRP(uint32_t WriteProtectPage, uint32_t Banks)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint16_t WRP0_Data = 0xFFFF;
  uint16_t WRP1_Data = 0xFFFF;
  uint16_t WRP2_Data = 0xFFFF;
  uint16_t WRP3_Data = 0xFFFF;

  /* Check the parameters */
  ASSERT_PARAM(IS_OB_WRP(WriteProtectPage));
  ASSERT_PARAM(IS_FLASH_BANK(Banks));

  /* Get current write protected pages and the new pages to be unprotected ******/
  WriteProtectPage = (FLASH_OB_GetWRP() | WriteProtectPage);

  WRP0_Data = (uint16_t)(WriteProtectPage & OB_WRP_PAGES0TO15MASK);
  WRP1_Data = (uint16_t)((WriteProtectPage & OB_WRP_PAGES16TO31MASK) >> 8U);
  WRP2_Data = (uint16_t)((WriteProtectPage & OB_WRP_PAGES32TO47MASK) >> 16U);
  WRP3_Data = (uint16_t)((WriteProtectPage & OB_WRP_PAGES48TO127MASK) >> 24U);

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

