betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_flash_ex.c
  if(status == DAL_OK)
  {
    /* Clean the error context */
    pFlash.ErrorCode = DAL_FLASH_ERROR_NONE;

    /* To be able to write again option byte, need to perform a option byte erase */
    status = DAL_FLASHEx_OBErase();
    if (status == DAL_OK)
    {
      /* Enable write protection */
      SET_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);

      if(WRP0_Data != 0xFFU)
      {
        OB->WRP0 |= WRP0_Data;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
      }

      if((status == DAL_OK) && (WRP1_Data != 0xFFU))
      {
        OB->WRP1 |= WRP1_Data;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
      }

      if((status == DAL_OK) && (WRP2_Data != 0xFFU))
      {
        OB->WRP2 |= WRP2_Data;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
      }

      if((status == DAL_OK) && (WRP3_Data != 0xFFU))
      {
        OB->WRP3 |= WRP3_Data;

        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
      }

      /* if the program operation is completed, disable the OPTPG Bit */
      CLEAR_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);
    }
  }

  return status;
}

/**
  * @brief  Set the read protection level.
  * @param  ReadProtectLevel specifies the read protection level.
  *         This parameter can be one of the following values:
  *            @arg @ref OB_RDP_LEVEL_0 No protection
  *            @arg @ref OB_RDP_LEVEL_1 Read protection of the memory
  * @retval DAL status
  */
static DAL_StatusTypeDef FLASH_OB_RDP_LevelConfig(uint8_t ReadProtectLevel)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_OB_RDP_LEVEL(ReadProtectLevel));

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

  if(status == DAL_OK)
  {
    /* Clean the error context */
    pFlash.ErrorCode = DAL_FLASH_ERROR_NONE;

    /* If the previous operation is completed, proceed to erase the option bytes */
    SET_BIT(FLASH->CTRL2, FLASH_CTRL2_OBE);
    SET_BIT(FLASH->CTRL2, FLASH_CTRL2_STA);

    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

    /* If the erase operation is completed, disable the OBE Bit */
    CLEAR_BIT(FLASH->CTRL2, FLASH_CTRL2_OBE);

    if(status == DAL_OK)
    {
      /* Enable the Option Bytes Programming operation */
      SET_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);

      WRITE_REG(OB->READPROT, ReadProtectLevel);

      /* Wait for last operation to be completed */
      status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

      /* if the program operation is completed, disable the OBP Bit */
      CLEAR_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);
    }
  }

  return status;
}

/**
  * @brief  Program the FLASH User Option Byte.
  * @note   Programming of the OB should be performed only after an erase (otherwise PGERR occurs)
  * @param  UserConfig The FLASH User Option Bytes values FLASH_OBR_IWDG_SW(Bit0),
  *         FLASH_OBR_nRST_STOP(Bit1),FLASH_OBR_nRST_STDBY(Bit2),FLASHEx_Option_Bytes_nROM_SEL(Bit4).
  * @retval DAL status
  */
static DAL_StatusTypeDef FLASH_OB_UserConfig(uint8_t UserConfig)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_OB_IWDT_SOURCE((UserConfig&OB_IWDT_SW)));
  ASSERT_PARAM(IS_OB_STOP_SOURCE((UserConfig&OB_STOP_NO_RST)));
  ASSERT_PARAM(IS_OB_STDBY_SOURCE((UserConfig&OB_STDBY_NO_RST)));
  ASSERT_PARAM(IS_OB_STDBY_SOURCE((UserConfig&OB_SEL_INFO)));

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

  if(status == DAL_OK)
  {
    /* Clean the error context */
    pFlash.ErrorCode = DAL_FLASH_ERROR_NONE;

    /* Enable the Option Bytes Programming operation */
    SET_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);

    OB->UOB = (UserConfig | 0xE8U);

    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

    /* if the program operation is completed, disable the OPTPG Bit */
    CLEAR_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);
  }

  return status;
}

/**
  * @brief  Programs a half word at a specified Option Byte Data address.
  * @note   The function @ref DAL_FLASH_Unlock() should be called before to unlock the FLASH interface
  *         The function @ref DAL_FLASH_OB_Unlock() should be called before to unlock the options bytes
  *         The function @ref DAL_FLASH_OB_Launch() should be called after to force the reload of the options bytes
  *         (system reset will occur)
  *         Programming of the OB should be performed only after an erase (otherwise PGERR occurs)
  * @param  Address specifies the address to be programmed.
  *         This parameter can be 0x1FFFF804 or 0x1FFFF806.
  * @param  Data specifies the data to be programmed.
  * @retval DAL status
  */
static DAL_StatusTypeDef FLASH_OB_ProgramData(uint32_t Address, uint8_t Data)
{
  DAL_StatusTypeDef status = DAL_ERROR;

  /* Check the parameters */
  ASSERT_PARAM(IS_OB_DATA_ADDRESS(Address));

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

  if(status == DAL_OK)
  {
    /* Clean the error context */
    pFlash.ErrorCode = DAL_FLASH_ERROR_NONE;

    /* Enables the Option Bytes Programming operation */
    SET_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);
    *(__IO uint16_t*)Address = Data;

    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

    /* If the program operation is completed, disable the OPTPG Bit */
    CLEAR_BIT(FLASH->CTRL2, FLASH_CTRL2_OBP);
  }
  /* Return the Option Byte Data Program Status */
  return status;
}

#endif /* APM32F403xx || APM32F402xx */

/**
  * @brief  Return the FLASH User Option Byte value.
  @if APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx
  * @retval uint8_t FLASH User Option Bytes values: IWDT_SW(Bit5), RST_STOP(Bit6)
  *         and RST_STDBY(Bit7).
  @endif
  @if APM32F402/403xx
  * @retval uint8_t FLASH User Option Bytes values: IWDT_SW(Bit0), RST_STOP(Bit1),
  *         RST_STDBY(Bit2) and ROM_SEL(Bit4).
  @endif
  */
static uint8_t FLASH_OB_GetUser(void)
{
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  /* Return the User Option Byte */
  return ((uint8_t)(FLASH->OPTCTRL & 0xE0));
#else
  /* Return the User Option Byte */
  return (uint8_t)((READ_REG(FLASH->OBCS) & FLASH_OBCS_UOB) >> FLASH_POSITION_OB_UOB_BIT);
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
}

/**
  * @brief  Return the FLASH Write Protection Option Bytes value.
  @if APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx
  * @retval uint16_t FLASH Write Protection Option Bytes value
  @endif
  @if APM32F402/403xx
  * @retval uint32_t FLASH Write Protection Option Bytes value
  @endif
  */
static uint32_t FLASH_OB_GetWRP(void)
{
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  /* Return the FLASH write protection Register value */
  return (*(__IO uint16_t *)(OPTCTRL_BYTE2_ADDRESS));
#else
  /* Return the FLASH write protection Register value */
  return (uint32_t)(READ_REG(FLASH->WRTPROT));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
}

/**
  * @brief  Returns the FLASH Read Protection level.
  * @retval FLASH ReadOut Protection Status:
  *         This parameter can be one of the following values:
  *            @arg OB_RDP_LEVEL_0: No protection
  *            @arg OB_RDP_LEVEL_1: Read protection of the memory
  *            @arg OB_RDP_LEVEL_2: Full chip protection (*)
  */
static uint8_t FLASH_OB_GetRDP(void)
{
  uint8_t readstatus = OB_RDP_LEVEL_0;

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  if (*(__IO uint8_t *)(OPTCTRL_BYTE1_ADDRESS) == (uint8_t)OB_RDP_LEVEL_2)
  {
    readstatus = OB_RDP_LEVEL_2;
  }
  else if (*(__IO uint8_t *)(OPTCTRL_BYTE1_ADDRESS) == (uint8_t)OB_RDP_LEVEL_0)
  {
    readstatus = OB_RDP_LEVEL_0;
  }
  else
  {
    readstatus = OB_RDP_LEVEL_1;
  }
#else
  if (READ_BIT(FLASH->OBCS, FLASH_OBCS_READPROT) == FLASH_OBCS_READPROT)
  {
    readstatus = OB_RDP_LEVEL_1;
  }
  else
  {
    readstatus = OB_RDP_LEVEL_0;
  }
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  return readstatus;
}

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
/**
  * @brief  Returns the FLASH BOR level.
  * @retval uint8_t The FLASH BOR level:
  *           - OB_BOR_LEVEL3: Supply voltage ranges from 2.7 to 3.6 V
  *           - OB_BOR_LEVEL2: Supply voltage ranges from 2.4 to 2.7 V
  *           - OB_BOR_LEVEL1: Supply voltage ranges from 2.1 to 2.4 V
  *           - OB_BOR_OFF   : Supply voltage ranges from 1.62 to 2.1 V
  */
static uint8_t FLASH_OB_GetBOR(void)
{
  /* Return the FLASH BOR level */
  return (uint8_t)(*(__IO uint8_t *)(OPTCTRL_BYTE0_ADDRESS) & (uint8_t)0x0C);
}
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @brief  Flush the instruction and data caches
  * @retval None
  */
void FLASH_FlushCaches(void)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  /* Flush instruction cache  */
  if (READ_BIT(FLASH->CTRL1, FLASH_CTRL1_ICACHEEN) != RESET)
#else
  /* Flush instruction cache  */
  if (READ_BIT(FLASH->ACCTRL, FLASH_ACCTRL_ICACHEEN) != RESET)
#endif /* APM32F403xx || APM32F402xx */
  {
    /* Disable instruction cache  */
    __DAL_FLASH_INSTRUCTION_CACHE_DISABLE();
    /* Reset instruction cache */
    __DAL_FLASH_INSTRUCTION_CACHE_RESET();
    /* Enable instruction cache */
    __DAL_FLASH_INSTRUCTION_CACHE_ENABLE();
  }

#if defined(APM32F403xx) || defined(APM32F402xx)
  /* Flush instruction cache  */
  if (READ_BIT(FLASH->CTRL1, FLASH_CTRL1_DCACHEEN) != RESET)
#else
  /* Flush data cache */
  if (READ_BIT(FLASH->ACCTRL, FLASH_ACCTRL_DCACHEEN) != RESET)
#endif /* APM32F403xx || APM32F402xx */
  {
    /* Disable data cache  */
    __DAL_FLASH_DATA_CACHE_DISABLE();
    /* Reset data cache */
    __DAL_FLASH_DATA_CACHE_RESET();
    /* Enable data cache */
    __DAL_FLASH_DATA_CACHE_ENABLE();
  }
}

/**
  * @}
  */

#endif /* DAL_FLASH_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

